#include "aboutdialog.h"
#include "ui_aboutdialog.h"


/******************************************************/
/*                                                    */
/*          готово                                    */
/*                                                    */
/******************************************************/


//-------------------------------------------------------------------------------------------------
AboutDialog::AboutDialog(QWidget *parent) : QWidget(parent), ui(new Ui::AboutDialog) {
    ui->setupUi(this);
    this->setWindowFlags(Qt::Popup | Qt::Window);
    setWindowOpacity(0);
    show();
}
//-------------------------------------------------------------------------------------------------
AboutDialog::~AboutDialog()
{
    delete ui;
}
//-------------------------------------------------------------------------------------------------
